# Homebrew 软件包管理器配置文件
# 使用 brew bundle install 命令安装所有软件

# ===== Homebrew Taps (第三方软件源) =====
tap "homebrew/bundle"              # Brewfile 支持
tap "homebrew/cask-fonts"          # 字体软件包
tap "homebrew/cask-versions"       # 软件的不同版本
tap "homebrew/services"            # 系统服务管理
tap "melonamin/formulae"           # 第三方软件源
tap "psviderski/tap"               # 第三方软件源
tap "telepresenceio/telepresence"  # Kubernetes 开发工具源

# ===== 命令行工具 (brew) =====
brew "autoconf"                    # 自动配置工具
brew "automake"                    # 自动化构建工具
brew "bash"                        # Bash shell
brew "curl"                        # 命令行 HTTP 客户端
brew "mas"                         # Mac App Store 命令行工具
brew "mise"                        # 运行时版本管理器
brew "git"
brew "fzf"
brew "awscli"
brew "jq"
brew "wget"
brew "tmux"
brew "neovim"
brew "ripgrep"
brew "coreutils"
brew "gnupg"
brew "age"
brew "nmap"

# ===== 应用程序 (cask) =====

cask "firefox"                     # Mozilla Firefox 浏览器
cask "google-chrome"               # Google Chrome 浏览器
cask "microsoft-edge"              # Microsoft Edge 浏览器
cask "alex313031-thorium"          # Thorium 浏览器，最快的 Chromium 浏览器

cask "font-fira-code-nerd-font"

cask "visual-studio-code"          # Visual Studio Code 代码编辑器
cask "iterm2"                      # 终端模拟器
cask "postman"                     # API 开发测试工具
cask "sequel-ace"                  # MySQL/MariaDB 数据库管理工具
cask "devtoys"                     # 开发者工具箱
cask "zed"                         # 高性能代码编辑器
cask "ghostty"                     # terminal

cask "alfred"                      # 快速启动器和生产力工具
cask "cleanshot"                   # 截图和屏幕录制工具
cask "keepassxc"                   # 密码管理器
cask "the-unarchiver"              # 解压缩工具
cask "selfcontrol"                 # 网站屏蔽工具，帮助专注工作
cask "bartender"                   # 隐藏菜单栏
cask "iina"                        # 视频播放器
cask "adrive"                      # 阿里云盘客户端
cask "anki"                        # 记忆卡片学习工具
cask "feishu"                      # 飞书办公协作平台
cask "calibre"                     # 电子书管理和转换工具
cask "tencent-meeting"             # 腾讯会议
cask "netnewswire"                 # RSS 阅读器

cask "transmission"                # BitTorrent 客户端


# ===== Mac App Store 应用 (mas) =====

mas "TestFlight", id: 899247664            # 苹果官方测试应用平台
mas "The Unarchiver", id: 425424353       # 解压缩工具

mas "Xcode", id: 497799835                 # 苹果官方开发环境
mas "Ridill SQLIte", id: 1058773711       # SQLite 数据库管理工具

mas "Craft", id: 1487937127                # 笔记和文档应用
mas "MindNode", id: 1289197285             # 思维导图
mas "Kindle", id: 302584613                # 亚马逊 Kindle 阅读器
mas "News Explorer", id: 1032670789        # RSS 新闻阅读器
mas "Reeder", id: 6475002485               # RSS 阅读器
mas "GoodLinks", id: 1474335294            # 稍后阅读工具
mas "Yomu", id: 562211012                  # 电子书和漫画阅读器

mas "Microsoft Word", id: 462054704        # 微软 Word 文档处理
mas "Microsoft PowerPoint", id: 462062816  # 微软 PowerPoint 演示文稿
mas "Pages文稿", id: 409201541             # 苹果 Pages 文档处理
mas "Numbers表格", id: 409203825           # 苹果 Numbers 表格处理
mas "Keynote讲演", id: 409183694           # 苹果 Keynote 演示文稿

mas "uPic", id: 1549159979                 # 图片上传工具


mas "Immersive Translate", id: 6447957425  # 沉浸式翻译工具

mas "Windows App", id: 1295203466          # Windows 远程桌面

mas "Boop", id: 1518425043                 # 开发者文本处理工具
mas "1-Click Video Converter", id: 717545086 # 视频格式转换
mas "Exporter", id: 1099120373             # 备忘录导出工具




# 专用工具
mas "Coffee Buzz", id: 1099454186          # 咖啡因追踪
mas "Flyleaf", id: 6475200381              # 阅读工具
mas "alto.computer", id: 6480425094        # 计算机监控

