# Homebrew 软件包管理器配置文件
# 使用 brew bundle install 命令安装所有软件

# ===== Homebrew Taps (第三方软件源) =====
tap "homebrew/bundle"              # Brewfile 支持
tap "homebrew/services"            # 系统服务管理

# ===== 命令行工具 (brew) =====
brew "bash"                        # Bash shell
brew "curl"                        # 命令行 HTTP 客户端
brew "mas"                         # Mac App Store 命令行工具
brew "mise"                        # 运行时版本管理器
brew "terminal-notifier"
brew "git"
brew "jq"
brew "wget"
brew "tmux"
brew "coreutils"
brew "gnupg"
brew "age"
brew "nmap"
brew "ffmpeg"
brew "sshpass"
brew "tree"
brew "fd"
brew "ripgrep"                     # 快速代码搜索（与 fd 配套）
brew "fzf"                         # 模糊查找（含 shell 集成脚本）
brew "mkcert"
brew "telnet"
brew "gh"
cask "cc-switch"
cask "wechat"
cask "tencent-lemon"

# ===== 应用程序 (cask) =====

cask "marta"               # 双面板文件管理器
  cask "keyboard-maestro"
cask "telegram"
cask "google-chrome"               # Google Chrome 浏览器
cask "google-chrome@beta" # Google Chrome Beta
cask "helium-browser" # Helium Browser, Mordern Browser from Chrome
cask "orion" # browser like Safari
cask "claude-code@latest"
cask "font-fira-code-nerd-font"

  cask "notion"
  cask "obsidian"
  cask "downie"       # 视频下载
cask "heynote"
cask "spotify"
cask "visual-studio-code"          # Visual Studio Code 代码编辑器
cask "sequel-ace"                  # MySQL/MariaDB 数据库管理工具
cask "zed"                         # 高性能代码编辑器
cask "ghostty"                     # terminal

cask "alfred"                      # 快速启动器和生产力工具
cask "cleanshot"                   # 截图和屏幕录制工具
cask "selfcontrol"                 # 网站屏蔽工具，帮助专注工作
cask "bartender"                   # 隐藏菜单栏
cask "iina"                        # 视频播放器
cask "feishu"                      # 飞书办公协作平台
cask "calibre"                     # 电子书管理和转换工具
cask "tencent-meeting"             # 腾讯会议
cask "netnewswire"                 # RSS 阅读器
cask "keepingyouawake"             # 菜单栏防睡眠工具


  cask "claude"              # Claude 桌面端
  cask "chatgpt"             # ChatGPT 桌面端
  cask "codex"               # OpenAI Codex 桌面端
  cask "postico"             # PostgreSQL GUI



# ===== Mac App Store 应用 (mas) =====

mas "TestFlight", id: 899247664            # 苹果官方测试应用平台
mas "The Unarchiver", id: 425424353       # 解压缩工具

mas "Xcode", id: 497799835                 # 苹果官方开发环境
mas "Ridill SQLIte", id: 1058773711       # SQLite 数据库管理工具
mas "MindNode", id: 1289197285             # 思维导图
mas "Microsoft Word", id: 462054704        # 微软 Word 文档处理
mas "Microsoft PowerPoint", id: 462062816  # 微软 PowerPoint 演示文稿
mas "Pages", id: 361309726                 # 苹果 Pages 文档处理（中区显示为"Pages 文稿"）
mas "Numbers", id: 361304891               # 苹果 Numbers 表格处理（中区显示为"Numbers 表格"）
mas "Keynote", id: 361285480               # 苹果 Keynote 演示文稿（中区显示为"Keynote 讲演"）

mas "uPic", id: 1549159979                 # 图片上传工具


mas "Immersive Translate", id: 6447957425  # 沉浸式翻译工具

mas "Windows App", id: 1295203466          # Windows 远程桌面

mas "Boop", id: 1518425043                 # 开发者文本处理工具
mas "1-Click Video Converter", id: 717545086 # 视频格式转换
mas "Exporter", id: 1099120373             # 备忘录导出工具





