tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
cask "firefox-developer-edition"
cask "anki"
cask "librewolf"
cask "google-chrome"
cask "loom"
cask "iina"
cask "arc"
cask "transmission" # p2p
cask "qbittorrent" # p2p
cask "zed" # editor
cask "iterm2"
cask "NetNewsWire" # rss 阅读器
cask "xquartz" # 用户x11 转发，这样远程服务器的内容就是复制到本地了
cask "alex313031-thorium" # Thorium 浏览器，最快的 chromium 浏览器
cask "eloston-chromium"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "alfred"
cask "tencent-meeting"
cask "selfcontrol" # 自控
cask "keepassxc"
cask "Calibre"
cask "cleanshot"
cask "sequel-ace"
mas "Outline", id: 1356178125
mas "iPic", id: 1101244278
mas "Microsoft Word", id: 462054704
mas "S3", id: 6447647340
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
